backend/src/tests/load/connection-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Test with a gradually increasing number of connections
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Warm up connections"
    - duration: 60
      arrivalRate: 100
      rampTo: 300
      name: "Medium connection load"
    - duration: 120
      arrivalRate: 300
      rampTo: 1000
      name: "High connection volume"
    - duration: 180
      arrivalRate: 1000
      name: "Maximum connection load"
  plugins:
    socket-io:
      transports: ["websocket"]
  processor: "./socket-processor.js"
  # Don't wait for graceful completion
  gracefulStop: 5

scenarios:
  - name: "Connect and stay connected"
    engine: "socket.io"
    flow:
      # Connect to the Socket.IO server
      - connect:
          headers:
            User-Agent: "Artillery Connection Test"

      # Authenticate immediately
      - emit:
          channel: "authenticate"
          data: "{{ generateWallet }}"

      # Send occasional pings to keep connection alive
      - loop:
          - think: 10
          - emit:
              channel: "ping"
        count: 30 # Stay connected for about 5 minutes